Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་ཆོ་ག་དང་བྲལ་བ་རྣམས་ནི་ཆོ་ག་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་དག་ཀྱང་ངེས་པར་སྟོན་པར་གྱུར་ཅིག །
en: In the same way, may I establish those without rules of conduct in the rules of conduct, and may I show the various kinds of virtuous conduct to beings.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དམ་པའི་ཆོས་ནུབ་ནས་རིང་པོ་མ་ལོན་པར་བདག་གིས་འཇིག་རྟེན་དུ་དམ་པའི་ཆོས་ཀྱི་ཚུལ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་དང་། དམ་པའི་ཆོས་འབྱུང་བ་དང་། དམ་པའི་ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་བགྱིད་པར་གྱུར་ཅིག །
en: When the good Dharma of those buddhas, those bhagavats, has ceased to exist, may I soon afterward become a guide in the good Dharma, a holder of the good Dharma, a source of the good Dharma, and shine as a lamp of the good Dharma in the world. “ ‘

source: མཚོན་གྱི་བསྐལ་པ་བར་མའི་དུས་ཀྱི་ཚེ་ན་སེམས་ཅན་རྣམས་སྲོག་གཅོད་པ་སྤོང་བ་དང་། ཡང་དག་པའི་ལྟ་བའི་བར་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: During the time of the intermediate eon of weapons, may I cause beings to abandon killing and establish them in the correct view.

source: སེམས་ཅན་རྣམས་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། ལམ་ངན་པ་དག་ནས་བཏོན་ཅིང་ཡང་དག་པའི་ལམ་དུ་འགོད་པར་གྱུར་ཅིག །
en: May I establish beings in the ten good actions, lead them from the bad path, and establish them in the correct path.

source: ཉེས་པར་སྤྱོད་པའི་མུན་པ་འཇིག་པར་བགྱིད་པར་གྱུར་ཅིག །
en: May I destroy the darkness of bad conduct.

source: ལེགས་པར་སྤྱོད་པའི་སྣང་བ་སྟོན་པར་གྱུར་ཅིག །
en: May I show the radiance of good conduct.

source: འཇིག་རྟེན་ན་དུས་ཀྱི་སྙིགས་མ་དང་། ཚེ་དང་། ལྟ་བ་དང་། ཉོན་མོངས་པའི་སྙིགས་མའི་བར་དག་འཇིག་པར་བགྱིད་པར་གྱུར་ཅིག །
en: May I destroy the degeneracies of the times, of life, of view, and of the kleśas in the world. “ ‘

source: མུ་གེའི་བསྐལ་པ་བར་མའི་དུས་ཀྱི་ཚེ་ན་བདག་སེམས་ཅན་རྣམས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བར་གྱུར་ཅིག །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཛུད་པར་གྱུར་ཅིག །
en: During the time of the intermediate eon of famine, may I enjoin beings to the perfection of generosity and so on until I encourage and introduce them to the perfection of wisdom.

source: བདག་སེམས་ཅན་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྦྱོར་བར་བགྱིད་པ་ན་ཐམས་ཅད་དུ་མུ་གེའི་མུན་པ་དང་། འཐབ་པ་དང་། རྙོག་པ་དང་། གཡུལ་ཤོམ་པ་དང་། ཁོན་དང་།
en: May I bring beings to the six perfections and bring to an end everywhere the darkness of famine, conflict, impurity, war, enmity, argument, and dispute.

source: རྩོད་པ་དང་། འགྱེད་པ་དག་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་ཉོན་མོངས་པའི་མེའི་གདུང་བ་དག་ཞི་བར་གྱུར་ཅིག །
en: May I extinguish the fire of the kleśas within beings. “ ‘

source: ནད་ཀྱི་བསྐལ་པ་བར་མའི་དུས་ཀྱི་ཚེ་ན་བདག་གིས་སེམས་ཅན་རྣམས་སྙིང་པོར་འགྱུར་བ་དང་། འཐུན་པའི་ཆོས་དྲུག་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་གྱུར་ཅིག །
en: During the time of the intermediate eon of disease, may I establish beings in the six conducive qualities.

source: བསྡུ་བའི་དངོས་པོ་བཞི་པོ་དག་ལ་སྦྱོར་བར་བགྱིད་ཅིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I bring them to the four qualities that gather beings.

source: སེམས་ཅན་རྣམས་ཀྱི་ནད་ཀྱི་མུན་པར་རྣམ་པར་འཇིག་པར་བགྱིད་པར་གྱུར་ཅིག །
en: May I destroy the darkness of the illness of beings.

source: སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ལ་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བགྱིད་པའི་བར་དུ་གྱུར་ཅིག །
en: May I end the kleśas within beings.

source: བསྐལ་པ་བཟང་པོ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་དེ་ལྟར་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་དག་ལས་ཡོངས་སུ་ཐར་བར་བགྱིད་པར་གྱུར་ཅིག །
en: In this way, in the Bhadraka eon, may I free all beings from such sufferings in the Sahā buddha realm. “ ‘

source: གང་གི་ཚེ་བསྐལ་པ་བཟང་པོ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྟོང་རྩ་བཞི་འབྱུང་བ་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ནས་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ནུབ་པར་གྱུར་པ་ན་དེའི་འོག་ཏུ་གདོད་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May I attain the complete enlightenment of perfect buddhahood after the 1,004 bhagavat buddhas in the great Bhadraka eon have arisen and passed into nirvāṇa and the entire way of the Dharma has entirely disappeared.

source: བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྟོང་རྩ་བཞི་པོ་དག་གི་སྐུ་ཚེའི་ཚད་ཇི་ཙམ་པར་བདག་གིས་བྱང་ཆུབ་ཐོབ་པའི་ཚེའི་ཚད་ཀྱང་དེ་ཙམ་དུ་རིང་བར་གྱུར་ཅིག །
en: When I have attained enlightenment, may I have a lifespan equivalent to that of all 1,004 buddha bhagavats of the Bhadraka eon.

source: དེ་དག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཇི་སྙེད་པར་བདག་གཅིག་པུའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་སྙེད་དུ་གྱུར་ཅིག །
en: May my saṅgha of śrāvakas be as numerous as all their śrāvaka saṅghas.

source: བསྐལ་པ་བཟང་པོ་དེ་ལ་སངས་རྒྱས་སྟོང་རྩ་བཞི་པོ་དེ་དག་གིས་སེམས་ཅན་ཇི་སྙེད་བཏུལ་བར་གྱུར་པའི་སེམས་ཅན་དེ་སྙེད་ཅིག་བདག་གིས་ཀྱང་བཏུལ་བར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཉན་ཐོས་ཀྱི་བསླབ་པ་ལ་འཁྲུལ་བར་གྱུར་པ་དང་། ལྟ་བའི་གཡང་སར་ལྷུང་བར་གྱུར་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མ་གུས་པའི་སེམས་དང་།
en: May I train as many beings as were trained by all 1,004 buddhas in the Bhadraka eon.

source: རབ་ཏུ་སྡང་བའི་སེམས་སུ་གྱུར་པ་དང་། ཆོས་དང་དགེ་འདུན་ལ་འཁྲུལ་པའི་སེམས་སུ་གྱུར་པ་དང་། འདོད་ཆགས་ཀྱི་སེམས་དག་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། མཚམས་མེད་པ་བགྱིད་པར་གྱུར་པ་དག་ཀྱང་བདག་གིས་བྱང་ཆུབ་ཐོབ་ནས་འཁོར་བའི་འདམ་ནས་འབྱིན་ཅིང་མི་འཇིགས་པའི་ཁྱིམ་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་འཛུད་པར་གྱུར་ཅིག །
en: Upon attaining enlightenment, may I free from the swamp of saṃsāra, and bring into the house of fearlessness in the city of nirvāṇa, all the śrāvakas of those buddhas who were mistaken in their training, who fell off the precipice of views, who were disrespectful to the bhagavat buddhas, who had angry minds, who were mistaken concerning the Dharma and the saṅgha, who had desiring minds, who maligned higher beings, and who committed the actions with immediate results at death. “ ‘

source: ཇི་སྲིད་དུ་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་བས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་ཡང་བས་པར་མ་གྱུར་ཅིག །
en: May the great Bhadraka eon not come to an end until I have passed into nirvāṇa and the good Dharma has come to an end.

source: བདག་གི་དམ་པའི་ཆོས་བས་པར་གྱུར་པ་ན་བསྐལ་པ་བཟང་པོ་ཡང་བས་པར་གྱུར་ཅིག །
en: May the Bhadraka eon come to an end when my Dharma has come to an end.

source: བདག་སྐྱེས་པའི་སྐུ་གདུང་གང་ལགས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་ཅིང་མཚན་རེ་རེ་ཡང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལེགས་པར་བརྒྱན་པ་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ཏུ་གྱུར་ཏེ་གནས་པར་གྱུར་ཅིག །
en: May the thirty-two signs and the eighty excellent features of a great being—of a tathāgata—adorn each of the countless, innumerable bodies of my rebirths.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་ཏུ་བཞུད་ནས། སངས་རྒྱས་ཀྱི་སྐུ་རེ་རེས་ཀྱང་སེམས་ཅན་དཔག་ཏུ་མ་མཆིས། གྲངས་མ་མཆིས་པ་རྣམས་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། འཛུད་ཅིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May those tathāgata bodies go to countless, innumerable empty buddha realms in the ten directions, and may each of those buddha bodies cause innumerable, countless beings to possess the three yānas and guide them and establish them in those.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་བར་གྱི་བསྐལ་པ་ཞིག་པར་མ་གྱུར་པ་དེར་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་བཞུད་ནས་ཇི་ལྟར་སྔར་བརྗོད་པ་དེ་ལྟར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར་ཞིང་སླད་ཀྱིས་ཡིད་བཞིན་གྱི་ནོར་བུར་གྱུར་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་དག་ན་སེམས་ཅན་རྣམས་རིན་པོ་ཆེ་དང་བྲལ་བར་གྱུར་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་མཆིས་ཤིང་རིན་པོ་ཆེའི་ཆར་རབ་ཏུ་འབེབས་པ་དང་། གཏེར་དག་ཀྱང་རབ་ཏུ་སྟོན་པར་གྱུར་ཅིག །
en: May those tathāgata bodies in those buddha realms protect beings as previously described until their intermediate eon comes to an end. “ ‘Afterward, may I become a wish-fulfilling jewel and go to the buddha realms where beings have no jewels, and may I cause a rain of jewels to fall and reveal treasures to them.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དག་ན་སེམས་ཅན་རྣམས་དགེ་བའི་སྤྱོད་པ་དང་བྲལ་ཞིང་ནད་ཀྱིས་ཉོན་མོངས་པ་ཅན་དུ་གྱུར་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་ཡང་ཙན་དན་ས་མཆོག་པ་དང་། སྦྲུལ་གྱི་སྙིང་པོ་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བ་དག་གི་སྤོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པར་གྱུར་ཅིག །སྤོས་ཀྱི་ཆར་དེ་དག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་ནད་རྣམས་དང་། ལྟ་བའི་ནད་རྣམས་དང་།
en: May I become a timely incense rain of gośīrṣa sandalwood and uragasāra sandalwood in those buddha realms where beings are devoid of good conduct and are afflicted by illness, and may those rains heal beings of the illness of the kleśas, the illness of views, and physical illness.

source: ལུས་ཀྱི་ནད་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་བགྱིད་པར་གྱུར་ཅིག །དེ་ནས་སེམས་ཅན་དེ་དག་ཀྱང་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དག་ལ་མངོན་པར་བརྩོན་པར་འགྱུར་ཞིང་མཐོ་རིས་ལ་གཞོལ་བར་ཡང་གྱུར་ཅིག །
en: May those beings dedicate themselves to the activities that create merit and go to the higher realms. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་ལྟར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, may I protect beings in that way while performing bodhisattva conduct.

source: བདག་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་པར་གྱུར་ཅིག །
en: When I have attained enlightenment, may I accomplish such buddha activity.

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མ་མཆིས་པ་དག་གི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་གྱུར་ཅིག །
en: And when I have passed into parinirvāṇa, may I protect beings in endless, infinite buddha realms in that way. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་ཞིང་། སེམས་ཅན་རྣམས་ཀྱི་སྨན་དུ་ཡང་མི་འགྱུར་བ་ལྟ་ན་བདག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མ་མཆིས་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་པ་དེ་དག་བསླུས་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་ཡང་མ་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if this wish of mine is not fulfilled, if I do not become a medicine for beings, then I will have deceived the bhagavat buddhas who reside, live, and remain, teaching the Dharma to beings in infinite, endless realms in the ten directions; may the Bhagavat not prophesy my highest, most complete enlightenment.

source: བཅོམ་ལྡན་འདས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་ཤིང་ལུང་བསྟན་པའི་སེམས་ཅན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་པ། དེ་དག་ཀྱང་བདག་གིས་ཐུགས་བྱུང་བར་བགྱིས་པར་གྱུར་ཅིག །
en: Bhagavat, when the many tens of millions of beings who are intent upon and have been prophesied to attain the highest, most complete enlightenment have become buddha bhagavats, may I turn away from them.

source: བདག་བྱང་ཆུབ་ཀྱི་སླད་དུ་ཡང་དང་ཡང་དུ་འཁོར་བར་འཁོར་བ་ན་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། དགེ་བའི་སྒྲ་དང་། དགེ་བའི་ཆོས་བགྱིད་པའི་སྒྲ་དག་རྣ་ལམ་དུ་གྲག་པར་མ་གྱུར་ཅིག །
en: And when for the sake of enlightenment I go round and round in saṃsāra, may my ears not hear the words Buddha, Dharma, Saṅgha, good actions, or practicing the virtuous qualities.

source: གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུར་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་ཞིང་སེམས་ཅན་རྣམས་ཀྱི་སྨན་དུ་ཡང་མི་འགྱུར་བ་ལྟ་ན་བདག་རྟག་ཏུ་མནར་མེད་པར་རྟོགས་པར་གྱུར་ཅིག །
en: If this wish of mine is not to be fulfilled and I do not become a medicine for beings, may I remain forever in Avīci.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྲམ་ཟེའི་ཁྱེའུ་སྟོབས་ཆེན་ཤུགས་འཆང་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: Then, noble son, the Tathāgata Ratnagarbha congratulated the brahmin youth Mahābalavegadhārin: ‘Excellent, worthy being, excellent!

source: །ཁྱོད་ནི་སེམས་ཅན་རྣམས་ཀྱི་སྨན་དུ་འགྱུར་ཞིང་སྡུག་བསྔལ་དག་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པར་ཡང་འགྱུར་ཏེ།
en: Worthy being, you will be a medicine for beings, and you will free them from suffering.

source: སྐྱེས་བུ་དམ་པ་དེའི་ཕྱིར་ཁྱོད་སྨན་གྱི་རྒྱལ་པོ་སྐར་མ་དྲི་མ་མེད་ཅེས་བྱ་བར་གྱུར་ཅིག །
en: Therefore, worthy being, you should be known as Bhaiṣajya­rāja­jyotirvi­mala.

source: སྨན་གྱི་རྒྱལ་པོ་སྐར་མ་དྲི་མ་མེད་པ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་བཟང་པོ་ལ་སངས་རྒྱས་སྟོང་རྩ་བཞི་པོ་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོར་མ་ལོན་པར་རང་གི་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པའི་བར་དག་བཞིན་དུ་བསོད་སྙོམས་འབུལ་བར་འགྱུར་ཞིང་།
en: Bhaiṣajya­rāja­jyotirvi­mala, in the future, when countless eons as numerous as the grains of sand in the Ganges River have passed, and a second series of countless eons as numerous as the grains of sand in the Ganges River has begun, in the Bhadraka eon, you will offer alms to the 1,004 buddhas soon after they attain buddhahood, just as you have prayed.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་བཤེས་གཉེན་གཙུག་ཕུད་བཟང་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ནུབ་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: After the Tathāgata Haripatracūḍabhadra has passed into parinirvāṇa and his Dharma has ceased to exist, you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་གསལ་མཛད་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: You will be the tathāgata, and so on, up to and including the bhagavat buddha, named Roca.

source: །ཁྱོད་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཕྱེད་དུ་འགྱུར་རོ།
en: Your lifespan will be half an eon.

source: །བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་སྟོང་རྩ་བཞི་པོ་དེ་དག་གི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཇི་སྙེད་དུ་འགྱུར་བ་ཁྱོད་གཅིག་པུའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་སྙེད་དུ་འགྱུར་ལ། སེམས་ཅན་དེ་སྙེད་ཀྱང་འདུལ་བར་འགྱུར་རོ།
en: You alone will have a saṅgha of śrāvakas as numerous as the śrāvaka saṅghas of all the 1,004 buddhas of the Bhadraka eon, and you will guide that many beings.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་ཇི་སྲིད་དུ་བསྐལ་པ་ཆེན་པོ་བཟང་པོའི་བསྐལ་པ་ཟད་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་དམ་པའི་ཆོས་ནུབ་པར་མི་འགྱུར་ལ།
en: After you have passed into parinirvāṇa, your Dharma will not cease for as long as the Bhadraka eon has not come to an end.

source: དེ་སྲིད་དུ་སངས་རྒྱས་ཀྱི་སྐུ་དག་ཀྱང་འབྱུང་བར་འགྱུར་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་སྤོས་ཀྱི་ཆར་པས་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་ནད་རྣམས་དང་། ལྟ་བའི་ནད་རྣམས་དང་། ལུས་ཀྱི་ནད་རྣམས་ཀྱི་བར་དག་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་པར་འགྱུར་ལ།
en: During that time, you will appear in the form of buddhas in other buddha realms, and with a rain of incense you will heal beings of the illness of the kleśas, the illness of views, and physical illnesses.

source: སེམས་ཅན་རྣམས་ཀྱང་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་ལ་རབ་ཏུ་འགོད་ཅིང་མཐོ་རིས་ལ་གཞོལ་བར་བྱེད་པར་ཡང་འགྱུར་རོ།། །།བམ་པོ་དགུ་པ།
en: Those beings will be established in the three activities that create merit, and they will go to the higher realms.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་སྐར་མ་དྲི་མ་མེད་པས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བསོད་ནམས་ཀྱི་མཚན་གྱིས་བརྒྱན་པའི་ཕྱག་གིས་བདག་གི་སྤྱི་བོ་ལ་བྱུག་པར་གསོལ།
en: Then, noble son, the bodhisattva Bhaiṣajya­rāja­jyotirvi­mala said, ‘Bhadanta Bhagavat, if these wishes of mine are to be fulfilled, then may the Bhagavat’s hand, which bears signs of merit, be placed upon the crown of my head.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་སྐར་མ་དྲི་མ་མེད་པའི་སྤྱི་བོ་ལ་བསོད་ནམས་བརྒྱའི་མཚན་གྱིས་བརྒྱན་པའི་ཕྱག་གིས་ཡོངས་སུ་བྱུག་པ་མཛད་ནས་དེ་ན་བཞུགས་སོ།
en: Then, noble son, the Tathāgata Ratnagarbha placed his hand, which bore the signs of a hundred merits, upon the crown of the head of the bodhisattva Bhaiṣajya­rāja­jyotirvi­mala and rested it there. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་སྐར་མ་དྲི་མ་མེད་པ་སེམས་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: Then, noble son, the bodhisattva Bhaiṣajya­rāja­jyotirvi­mala had joy and happiness; he rejoiced and was joyful.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་མགོ་བོས་ཕྱག་བྱས་ནས་ལངས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་།
en: He bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, got up, and stood to one side. “

source: བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ལྷའི་ཀ་ཤི་ཀའི་གོས་བསྐོན་ཏེ་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: The brahmin Samudrareṇu covered him with a silken robe and said, ‘Excellent, worthy being, excellent!

source: །ཁྱོད་ཀྱིས་སྨོན་ལམ་བཟང་པོ་བཏབ་སྟེ།
en: You have made a splendid prayer.

source: ད་ཕྱིན་ཆད་ཁྱོད་ཀྱིས་ཁོ་བོའི་བསྙེན་བཀུར་བྱ་མི་དགོས་ཀྱི་ཇི་ལྟར་བདེ་བ་ཉིད་དུ་སྤྱོད་ཅིག །
en: From now on you do not need to serve and honor me but are free to do as you wish.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་ན་སྣང་བ་ལྟར་བདག་གིས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: Then, noble son, the brahmin Samudrareṇu thought, ‘I have made many hundreds of thousands of millions of trillions of beings go toward the highest, most complete enlightenment.

source: །སེམས་ཅན་ཆེན་པོ་འདི་དག་ཐམས་ཅད་ཀྱིས་ནི་སྨོན་ལམ་རྒྱ་ཆེ་བ་དགུ་བཏབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་དང་བ་ཤ་སྟག་ཡོངས་སུ་བླངས་ཏེ།
en: I see that in this entire assembly, all these mahāsattvas have made various vast prayers in which they have chosen perfectly pure buddha realms.

source: ཁྱབ་འཇུག་རླུང་མ་གཏོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གིས་རྩོད་པའི་དུས་ཡོངས་སུ་སྤངས་པས་བདག་གིས་ནི་རྩོད་པའི་དུས་ལ་བབ་པར་གྱུར་པ་ན།
en: Apart from Vāyuviṣṇu, all the bodhisattvas have avoided a kaliyuga.

source: སེམས་ཅན་རྣམས་ཆོས་ཀྱི་བཅུད་ཀྱིས་འགྲོན་དུ་གཉེར་བར་བྱ་ཞིང་བརྩོན་འགྲུས་བརྟན་པོར་བྱ་སྟེ།
en: Therefore, I shall make a firm resolve to take care of the beings in a kaliyuga with the elixir of the Dharma.

source: བདག་གིས་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདི་དག་ཐམས་ཅད་ངོ་མཚར་ཐོབ་པར་འགྱུར་བ་དང་།
en: I shall sound the lion’s roar of such a prayer, such that the entire assembly of bodhisattvas will be astonished.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་དང་། ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་བཅས་པའི་འཇིག་རྟེན་འདི་ཡང་བདག་ལ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ཞིང་མཆོད་པ་བྱེད་པར་འགྱུར་བ་དང་།
en: This entire assembly and the devas, gandharvas, humans, and asuras of this world will place their hands together, pay homage to me, and make offerings to me.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདི་ཡང་བདག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཞིང་ལུང་སྟོན་པར་འགྱུར་བ་དང་།
en: And this buddha bhagavat will say to me, “Excellent!” and will give me his prophecy.

source: དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཕྱོགས་བཅུ་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་བདག་གིས་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་ཡང་མཛད་ལ་ཕོ་ཉ་དག་ཀྱང་གཏོང་བར་འགྱུར་བ་དང་།
en: In the same way, the buddha bhagavats who reside, live, and remain in the ten directions, teaching the Dharma to beings, will say “Excellent!” about my lion’s roar. They will prophesy my attainment of the highest, most complete enlightenment and send emissaries to me.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདིས་ཀྱང་དེ་ཐོས་ཤིང་ཕོ་ཉ་དེ་དག་ཀྱང་མཐོང་བར་འགྱུར་བ་དང་། གང་ཡང་ཕྱི་མའི་དུས་ན་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཀྱང་དེ་ལྟ་བུའི་རྩོད་པ་ཆེན་པོའི་དུས་ཀྱི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དུ་སྨོན་ལམ་གྱིས་བྱང་ཆུབ་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཞིང་ཆོས་ཀྱི་མུ་གེའི་དགོན་པ་དང་།
en: This entire assembly will hear and see those emissaries, and in the future, they will be bodhisattvas who have great compassion. They will aspire to enlightenment and pray to be in such an afflicted buddha realm during the time of a great kaliyuga.

source: ཉོན་མོངས་པ་དང་། ནད་དག་གིས་བདས་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར་ཞིང་སངས་རྒྱས་ཀྱི་མཛད་པ་ཡང་མཛད་པར་འགྱུར་ལ་སེམས་ཅན་རྣམས་ལ་ཡང་ཆོས་སྟོན་པར་འགྱུར་བ་དང་།
en: They will protect those beings who are in a Dharma famine and are carried away by a flood of kleśas and illness. Those bodhisattvas will carry out the deeds of a buddha and teach the Dharma to beings. “ ‘

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བསམ་གྱིས་མི་ཁྱབ་པ་དག་འདས་ཀྱི་བར་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞལ་དུ་མ་མཆིས་པ་དང་། དཔག་ཏུ་མ་མཆིས་པ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མ་མཆིས་པ་དག་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བསྔགས་པ་རྗོད་ཅིང་སྙན་པ་དང་དབྱངས་ཀྱང་སྒྲོགས་པར་འགྱུར་ལ།
en: Once I have passed into nirvāṇa, countless buddha bhagavats in infinite, countless buddha realms in the ten directions will for inconceivable hundreds of millions of trillions of eons utter praises and proclaim the glory and fame of my passing into parinirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མདུན་དུ་བདག་གི་སྨོན་ལམ་གྱི་ཚུལ་ཡང་རྗོད་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྒོས་ཤིང་བྱིན་གྱིས་བརླབས་པའི་སྨོན་ལམ་ཐོས་ནས་མཆོག་ཏུ་ངོ་མཚར་དུ་འཛིན་པར་འགྱུར་ཞིང་།
en: They will describe the nature of my prayer in front of bodhisattvas, and when those bodhisattvas hear my prayer that is pervaded and blessed by great compassion, they will be completely astonished.

source: དེ་དག་ཀྱང་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་བ་དང་།
en: Then they too will develop great compassion toward beings.

source: དེ་ནས་དེ་དག་ཀྱང་སྨོན་ལམ་དེ་ལྟ་བུ་དག་ཉིད་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཞིང་ཇི་ལྟར་ད་ལྟར་བདག་གིས་ཡོངས་སུ་བཟུང་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དག་ཏུ་དེ་དག་ཀྱང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་།
en: Then they too will adopt the same kind of prayer that I have adopted. They too will attain the complete enlightenment of perfect buddhahood in such an afflicted buddha realm.

source: ཆུ་བོ་བཞིས་བདས་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་སྒྲོལ་བར་འགྱུར་ཞིང་ཐེག་པ་གསུམ་པོ་དག་གིས་འདུལ་བར་འགྱུར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་གྱི་བར་དག་ལ་འགོད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སྨོན་ལམ་གྱིས་སེང་གེའི་སྒྲ་བསྒྲག་པར་བྱའོ་སྙམ་མོ།
en: They will rescue beings swept away by the four great rivers and train them through the three yānas and establish them on the path to nirvāṇa. I shall sound a lion’s roar with such a prayer.’ “

source: །རིགས་ཀྱི་བུ་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྒོས་པའི་སྨོན་ལམ་དེ་ལྟ་བུ་དག་ཡང་དག་པར་བསྐྱེད་ནས་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་ངོ་།
en: Noble son, the brahmin Samudrareṇu, the principal royal priest, having created a prayer pervaded by great compassion, removed his Dharma robe from one shoulder, and went to where the Tathāgata Ratnagarbha was.

source: །ཡང་དེའི་ཚེ་ན་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ནམ་མཁའི་དཀྱིལ་ནས་ལྷའི་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གསིལ་དཀྲོལ་ཞིང་། མེ་ཏོག་གི་ཆར་རབ་ཏུ་ཕབ་ནས་ཚིག་འཐུན་པར་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: At that time, many hundreds of thousands of millions of trillions of devas played hundreds of thousands of millions of trillions of instruments in the middle of the sky, a rain of flowers fell, and they all exclaimed in one voice: “ ‘Excellent, worthy being, excellent!

source: །ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སོང་ལ་སྨོན་ལམ་རབ་མཆོག་དག་ཤོད་ལ་ཟུང་ཤིག་དང་།
en: Go before the Bhagavat and make your supreme prayer!

source: ཁྱོད་ནི་ཉོན་མོངས་པས་དཀྲུགས་པའི་འཇིག་རྟེན་དུ་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཡེ་ཤེས་ཀྱི་ཆུས་རབ་ཏུ་ཞི་བར་བྱེད་པར་འགྱུར་རོ།
en: With the water of wisdom, you will end the suffering of beings in a world disturbed by the kleśas!’ “

source: །ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་ཀྱང་ཐལ་མོ་སྦྱར་ཏེ་མངོན་དུ་ཕྱོགས་ནས་ཚིག་འཐུན་པར་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: The entire assembly placed their palms together, and facing him said in one voice, ‘Excellent, worthy being, excellent!

source: །མཁས་པ་རབ་མཆོག་བདག་ཅག་ལ་ཕན་པར་མཛད་པ་བློ་མཆོག་མངའ་བ་སྨོན་ལམ་བརྟན་པོར་ཐོབ་ཤིག་དང་། བདག་ཅག་ཀྱང་ཉན་པར་འཚལ་ལོ། །གང་གི་ཚེ་མདུན་ན་འདོན་སོང་སྟེ།
en: Supremely wise one, you who are our benefactor, you who have a supreme mind, make your unwavering prayer—we wish to hear it!’ “

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མདུན་ན་འདོན་གྱིས་པུས་མོའི་ལྷ་ང་བཙུགས་པ་དང་དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་རྟོག་གི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་ཙམ་པ་དེ་ཐམས་ཅད་གཡོས། རབ་ཏུ་གཡོས། འགུལ། རབ་ཏུ་འགུལ། འཁྲུགས།
en: When the royal priest came before the Bhagavat and knelt upon the ground, the billion-world universe, this entire Saṃtīraṇa buddha realm, shook, shook intensely, quivered, quivered intensely, quaked, quaked intensely, shuddered, and shuddered intensely.
